#+title: Checkup all GSD

#+PROPERTY: header-args:jupyter-python  :tangle   yes
#+PROPERTY: header-args:jupyter-python  :tangle   no

#+PROPERTY: header-args:jupyter-python+ :shebang  "#!/usr/bin/env ipython\n# -*- coding: utf-8 -*-\n\n"
#+PROPERTY: header-args:jupyter-python+ :eval     yes
#+PROPERTY: header-args:jupyter-python+ :comments org
#+PROPERTY: header-args:jupyter-python+ :results  raw drawer pp
#+PROPERTY: header-args:jupyter-python+ :exports  both
#+PROPERTY: header-args:jupyter-python+ :async    yes

#+PROPERTY: header-args:jupyter-python+ :session  python3 :kernel python3
#+PROPERTY: header-args:jupyter-python+ :session  remote_fast8_jiko_at_buka2 :kernel remote_fast8_jiko_at_buka2
#+PROPERTY: header-args:jupyter-python+ :session  local_fast8 :kernel local_fast8

#+LATEX_CMD:   xelatex
#+LATEX_CLASS: article

#+LATEX_CLASS_OPTIONS: [a4paper,10pt,onecolumn,oneside,openright]

#+JIKO-CONFIG: use-minted
#+JIKO-CONFIG: use-biblatex-apa7
#+JIKO-CONFIG: use-hyperref-setup
#+JIKO-CONFIG: use-threeparttable

#+LATEX_HEADER_EXTRA: \IfFileExists{~/bib_cat/ref.bib}{\addbibresource{~/bib_cat/ref.bib}}{}
#+LATEX_HEADER_EXTRA: \IfFileExists{main.bib}{\addbibresource{main.bib}}{}

#+OPTIONS: author:nil
#+OPTIONS: email:nil
#+OPTIONS: date:nil
#+OPTIONS: toc:nil
#+OPTIONS: ^:{}



* Boilerplate
** test: Logger and Location
#+begin_src jupyter-python :async yes :tangle no
import nvm
import srsly
import pathlib
logZ = nvm.Log0()
log0 = logZ.logger
locations = """
stardust7:
  jiko: cc/dev/c2023a/c0431_bertagent-SOM/code/c0001_devel-stage-05/
buka2:
  jiko: cc/dev/c2023a/c0431_bertagent-SOM/code/c0001_devel-stage-05/
"""
locations = srsly.yaml_loads(locations)
log0.info(f"{nvm.chdir(locations)}")
#+end_src

** test: Auto reload
#+begin_src jupyter-python :async yes
get_ipython().run_line_magic("load_ext", "autoreload")
get_ipython().run_line_magic("autoreload", "2")
#+end_src

* Imports
** prod: NVM
#+begin_src jupyter-python :async yes
from nvm import disp_df
from nvm import repr_df
from nvm import rdf
from nvm import ddf
from nvm import clean_str
from nvm.aux_str import CLEAN_STR_MAPPINGS_LARGE as maps0
from nvm.aux_str import REGEX_ABC_DASH_XYZ_ASTERISK as re0
from nvm.aux_pandas import fix_column_names
#+end_src

** prod: Basics
#+begin_src jupyter-python :async yes
import os
import pathlib
import numpy as np
import pandas as pd
import re
import json
import yaml
import srsly
import uuid
import random
import numbers
from collections import OrderedDict
from contextlib import ExitStack
import warnings
# warnings.warn("\nwarning")
from hashlib import md5
import humanfriendly as hf
import time
import datetime as dt
from pytz import timezone as tz
tz0 = tz("Europe/Berlin")
from glob import glob
from tqdm import tqdm
import logging
log0.info("DONE: basic imports")
#+end_src

** prod: Extra imports and settings
#+begin_src jupyter-python :async yes
from contexttimer import Timer
import textwrap

HOME = pathlib.Path.home()

tqdm.pandas()

import matplotlib
from matplotlib import pyplot as plt
# import seaborn as sns
import plotly.graph_objects as go
import plotly.express as px

get_ipython().run_line_magic("matplotlib", "qt")
# get_ipython().run_line_magic("matplotlib", "inline")

with Timer() as elapsed:
    time.sleep(0.001)

log0.info(hf.format_timespan(elapsed.elapsed))

log0.info("DONE: extra imports and settings")
#+end_src

* Extra Imports
** prod: More extra imports and settings
#+begin_src jupyter-python :async yes

log0.info("DONE: more extra imports and settings")
#+end_src

* Process
** prod: Load data
#+begin_src jupyter-python :async yes
dir0 = "../../data/u0005-qualtrics-results/test-002-init-10"
dir0 = "../../data/u0005-qualtrics-results/test-003-init-45"
dir0 = "../../data/u0005-qualtrics-results/test-004-init-90"
dir0 = pathlib.Path(dir0)
# dir0.mkdir(mode=0o700, parents=True, exist_ok=True)
assert dir0.exists(), f"The data directory dir0={str(dir0)} not found!"

name0 = f"GS_045_April+5,+2023_16.30.csv"
name0 = f"GS_045_April+5,+2023_19.55.csv"
name0 = f"GS_045_April+5,+2023_22.29.csv"

if0 = dir0/name0
log0.info(f"loading: {if0}...")
df1 = pd.read_csv(if0)
log0.info(f"loading: {if0}... DONE")

log0.info(f"{df1.shape = }")
disp_df(df1.sample(n=8).sort_index(), width=4444)
#+end_src

** test: Checkup sample record
#+begin_src jupyter-python :async yes
idx0 = df1.index[-1] # last actual data record
idx0 = df1.index[1]  # column descriptions
idx0 = df1.index[0]  # nice column names
idx0 = df1.index[2]  # first actual data record
disp_df(df1.loc[idx0, :].head(n=36), max_colwidth=77)
disp_df(df1.loc[idx0, :].tail(n=36), max_colwidth=77)
#+end_src

#+RESULTS:
:RESULTS:
#+begin_example
StartDate                                                                              2023-04-05 02:04:05
EndDate                                                                                2023-04-05 02:17:41
Status                                                                                          IP Address
IPAddress                                                                                              NaN
Progress                                                                                               100
Duration (in seconds)                                                                                  816
Finished                                                                                              True
RecordedDate                                                                           2023-04-05 02:17:42
ResponseId                                                                               R_3HhudDvjmqkpvLW
RecipientLastName                                                                                      NaN
RecipientFirstName                                                                                     NaN
RecipientEmail                                                                                         NaN
ExternalReference                                                                                      NaN
LocationLatitude                                                                                       NaN
LocationLongitude                                                                                      NaN
DistributionChannel                                                                              anonymous
UserLanguage                                                                                            EN
Q_RecaptchaScore                                                                                         1
Q_RelevantIDDuplicate                                                                                  NaN
Q_RelevantIDDuplicateScore                                                                               0
Q_RelevantIDFraudScore                                                                                   0
Q_RelevantIDLastStartDate                                                                              NaN
q005_consent                  I confirm that I have read and understood the information about this stud...
q006_prolificid                                                                   6282ac6bddcf580b46bdef2d
q007_english                                                                         I am a native speaker
train_q001                                                                                    anti-agentic
train_q002                                                                                  agency-neutral
train_q003                                                                                     pro-agentic
train_q004                                                                                    anti-agentic
train_q005                                                                                  agency-neutral
train_q006                                                                                     pro-agentic
train_q007                                                                                    anti-agentic
train_q008                                                                                  agency-neutral
train_q009                                                                                     pro-agentic
MAIN_001                                                                                      anti-agentic
MAIN_002                                                                                               NaN
Name: 2, dtype: object
#+end_example
#+begin_example
MAIN_278                           anti-agentic
MAIN_279                                    NaN
MAIN_280                                    NaN
MAIN_281                         agency-neutral
MAIN_282                         agency-neutral
MAIN_283                            pro-agentic
MAIN_284                                    NaN
MAIN_285                                    NaN
MAIN_286                                    NaN
MAIN_287                            pro-agentic
MAIN_288                                    NaN
MAIN_289                                    NaN
MAIN_290                                    NaN
MAIN_291                           anti-agentic
MAIN_292                            pro-agentic
MAIN_293                            pro-agentic
MAIN_294                                    NaN
MAIN_295                                    NaN
MAIN_296                            pro-agentic
MAIN_297                                    NaN
MAIN_298                           anti-agentic
MAIN_299                                    NaN
MAIN_300                                    NaN
Q1_ATTENTION_p01                           2024
Q1_ATTENTION_n01                           2022
q061_gender                                Male
q061_gender_3_TEXT                          NaN
q062_edu                    Secondary education
q062_edu_7_TEXT                             NaN
q063_age                                     54
q064_english              I am a native speaker
final_q001_comments                         NaN
final_q002_ID          6282ac6bddcf580b46bdef2d
SC0                                           9
PROLIFIC_PID           6282ac6bddcf580b46bdef2d
score0                                        9
Name: 2, dtype: object
#+end_example
:END:

** prod: Put column descriptions in a dictionary and drop obsolete rows from DF
#+begin_src jupyter-python :async yes
# put first two rows to dictionary using column name as dictionary key
descr_rows = [0, 1]
dc0 = df1.loc[descr_rows, :].to_dict(orient="dict")
dc4 = {}
# improve column descriptions dictionary
for key0, val0 in dc0.items():
    # drop blank lines and copy value from subkey 0 to subkey 2
    dc0[key0][2] = "\n".join([line0.strip() for line0 in val0[0].split("\n") if line0.strip() != ""])
    # keep the first line only in subkey 0, for target questions this line contains  wordnet ID
    dc0[key0][0] = val0[0].split("\n")[0]
    dc4[key0] = dc0[key0][2].split("\n")[-1]

# copy df without rows containing column descriptions
# NB: copy is used here only for the script development purpose,
# it should be dropped for production (TODO)
df2 = df1.drop(labels=descr_rows, axis=0).reset_index(drop=True).copy()

log0.info(f"{df2.shape = }")
df2 = df2[df2.Finished=="True"]
df2 = df2[df2.Progress=="100"]
df2 = df2[df2.PROLIFIC_PID.apply(lambda x: len(x) > 20 )]
log0.info(f"{df2.shape = }")


# drop redundant variables
del descr_rows

log0.info("DONE")
log0.info(f"{df2.shape = }")
disp_df(df2.sample(n=8).sort_index(), width=4444)
#+end_src
** Cols
#+begin_src jupyter-python :async yes
for col0 in df2.columns:
    print(f"    \"{col0}\",")

#+end_src

#+RESULTS:
#+begin_example
    "StartDate",
    "EndDate",
    "Status",
    "IPAddress",
    "Progress",
    "Duration (in seconds)",
    "Finished",
    "RecordedDate",
    "ResponseId",
    "RecipientLastName",
    "RecipientFirstName",
    "RecipientEmail",
    "ExternalReference",
    "LocationLatitude",
    "LocationLongitude",
    "DistributionChannel",
    "UserLanguage",
    "Q_RecaptchaScore",
    "Q_RelevantIDDuplicate",
    "Q_RelevantIDDuplicateScore",
    "Q_RelevantIDFraudScore",
    "Q_RelevantIDLastStartDate",
    "q005_consent",
    "q006_prolificid",
    "q007_english",
    "train_q001",
    "train_q002",
    "train_q003",
    "train_q004",
    "train_q005",
    "train_q006",
    "train_q007",
    "train_q008",
    "train_q009",
    "MAIN_001",
    "MAIN_002",
    "MAIN_003",
    "MAIN_004",
    "MAIN_005",
    "MAIN_006",
    "MAIN_007",
    "MAIN_008",
    "MAIN_009",
    "MAIN_010",
    "MAIN_011",
    "MAIN_012",
    "MAIN_013",
    "MAIN_014",
    "MAIN_015",
    "MAIN_016",
    "MAIN_017",
    "MAIN_018",
    "MAIN_019",
    "MAIN_020",
    "MAIN_021",
    "MAIN_022",
    "MAIN_023",
    "MAIN_024",
    "MAIN_025",
    "MAIN_026",
    "MAIN_027",
    "MAIN_028",
    "MAIN_029",
    "MAIN_030",
    "MAIN_031",
    "MAIN_032",
    "MAIN_033",
    "MAIN_034",
    "MAIN_035",
    "MAIN_036",
    "MAIN_037",
    "MAIN_038",
    "MAIN_039",
    "MAIN_040",
    "MAIN_041",
    "MAIN_042",
    "MAIN_043",
    "MAIN_044",
    "MAIN_045",
    "MAIN_046",
    "MAIN_047",
    "MAIN_048",
    "MAIN_049",
    "MAIN_050",
    "MAIN_051",
    "MAIN_052",
    "MAIN_053",
    "MAIN_054",
    "MAIN_055",
    "MAIN_056",
    "MAIN_057",
    "MAIN_058",
    "MAIN_059",
    "MAIN_060",
    "MAIN_061",
    "MAIN_062",
    "MAIN_063",
    "MAIN_064",
    "MAIN_065",
    "MAIN_066",
    "MAIN_067",
    "MAIN_068",
    "MAIN_069",
    "MAIN_070",
    "MAIN_071",
    "MAIN_072",
    "MAIN_073",
    "MAIN_074",
    "MAIN_075",
    "MAIN_076",
    "MAIN_077",
    "MAIN_078",
    "MAIN_079",
    "MAIN_080",
    "MAIN_081",
    "MAIN_082",
    "MAIN_083",
    "MAIN_084",
    "MAIN_085",
    "MAIN_086",
    "MAIN_087",
    "MAIN_088",
    "MAIN_089",
    "MAIN_090",
    "MAIN_091",
    "MAIN_092",
    "MAIN_093",
    "MAIN_094",
    "MAIN_095",
    "MAIN_096",
    "MAIN_097",
    "MAIN_098",
    "MAIN_099",
    "MAIN_100",
    "MAIN_101",
    "MAIN_102",
    "MAIN_103",
    "MAIN_104",
    "MAIN_105",
    "MAIN_106",
    "MAIN_107",
    "MAIN_108",
    "MAIN_109",
    "MAIN_110",
    "MAIN_111",
    "MAIN_112",
    "MAIN_113",
    "MAIN_114",
    "MAIN_115",
    "MAIN_116",
    "MAIN_117",
    "MAIN_118",
    "MAIN_119",
    "MAIN_120",
    "MAIN_121",
    "MAIN_122",
    "MAIN_123",
    "MAIN_124",
    "MAIN_125",
    "MAIN_126",
    "MAIN_127",
    "MAIN_128",
    "MAIN_129",
    "MAIN_130",
    "MAIN_131",
    "MAIN_132",
    "MAIN_133",
    "MAIN_134",
    "MAIN_135",
    "MAIN_136",
    "MAIN_137",
    "MAIN_138",
    "MAIN_139",
    "MAIN_140",
    "MAIN_141",
    "MAIN_142",
    "MAIN_143",
    "MAIN_144",
    "MAIN_145",
    "MAIN_146",
    "MAIN_147",
    "MAIN_148",
    "MAIN_149",
    "MAIN_150",
    "MAIN_151",
    "MAIN_152",
    "MAIN_153",
    "MAIN_154",
    "MAIN_155",
    "MAIN_156",
    "MAIN_157",
    "MAIN_158",
    "MAIN_159",
    "MAIN_160",
    "MAIN_161",
    "MAIN_162",
    "MAIN_163",
    "MAIN_164",
    "MAIN_165",
    "MAIN_166",
    "MAIN_167",
    "MAIN_168",
    "MAIN_169",
    "MAIN_170",
    "MAIN_171",
    "MAIN_172",
    "MAIN_173",
    "MAIN_174",
    "MAIN_175",
    "MAIN_176",
    "MAIN_177",
    "MAIN_178",
    "MAIN_179",
    "MAIN_180",
    "MAIN_181",
    "MAIN_182",
    "MAIN_183",
    "MAIN_184",
    "MAIN_185",
    "MAIN_186",
    "MAIN_187",
    "MAIN_188",
    "MAIN_189",
    "MAIN_190",
    "MAIN_191",
    "MAIN_192",
    "MAIN_193",
    "MAIN_194",
    "MAIN_195",
    "MAIN_196",
    "MAIN_197",
    "MAIN_198",
    "MAIN_199",
    "MAIN_200",
    "MAIN_201",
    "MAIN_202",
    "MAIN_203",
    "MAIN_204",
    "MAIN_205",
    "MAIN_206",
    "MAIN_207",
    "MAIN_208",
    "MAIN_209",
    "MAIN_210",
    "MAIN_211",
    "MAIN_212",
    "MAIN_213",
    "MAIN_214",
    "MAIN_215",
    "MAIN_216",
    "MAIN_217",
    "MAIN_218",
    "MAIN_219",
    "MAIN_220",
    "MAIN_221",
    "MAIN_222",
    "MAIN_223",
    "MAIN_224",
    "MAIN_225",
    "MAIN_226",
    "MAIN_227",
    "MAIN_228",
    "MAIN_229",
    "MAIN_230",
    "MAIN_231",
    "MAIN_232",
    "MAIN_233",
    "MAIN_234",
    "MAIN_235",
    "MAIN_236",
    "MAIN_237",
    "MAIN_238",
    "MAIN_239",
    "MAIN_240",
    "MAIN_241",
    "MAIN_242",
    "MAIN_243",
    "MAIN_244",
    "MAIN_245",
    "MAIN_246",
    "MAIN_247",
    "MAIN_248",
    "MAIN_249",
    "MAIN_250",
    "MAIN_251",
    "MAIN_252",
    "MAIN_253",
    "MAIN_254",
    "MAIN_255",
    "MAIN_256",
    "MAIN_257",
    "MAIN_258",
    "MAIN_259",
    "MAIN_260",
    "MAIN_261",
    "MAIN_262",
    "MAIN_263",
    "MAIN_264",
    "MAIN_265",
    "MAIN_266",
    "MAIN_267",
    "MAIN_268",
    "MAIN_269",
    "MAIN_270",
    "MAIN_271",
    "MAIN_272",
    "MAIN_273",
    "MAIN_274",
    "MAIN_275",
    "MAIN_276",
    "MAIN_277",
    "MAIN_278",
    "MAIN_279",
    "MAIN_280",
    "MAIN_281",
    "MAIN_282",
    "MAIN_283",
    "MAIN_284",
    "MAIN_285",
    "MAIN_286",
    "MAIN_287",
    "MAIN_288",
    "MAIN_289",
    "MAIN_290",
    "MAIN_291",
    "MAIN_292",
    "MAIN_293",
    "MAIN_294",
    "MAIN_295",
    "MAIN_296",
    "MAIN_297",
    "MAIN_298",
    "MAIN_299",
    "MAIN_300",
    "Q1_ATTENTION_p01",
    "Q1_ATTENTION_n01",
    "q061_gender",
    "q061_gender_3_TEXT",
    "q062_edu",
    "q062_edu_7_TEXT",
    "q063_age",
    "q064_english",
    "final_q001_comments",
    "final_q002_ID",
    "SC0",
    "PROLIFIC_PID",
    "score0",
#+end_example

** Summaries
#+begin_src jupyter-python :async yes
log0.info(f"{df2.shape = }")
disp_df(df2.head(n=8).sort_index(), width=4444)

#+end_src

** Check for missing and incomplete data
#+begin_src jupyter-python :async yes
# q061_gender
# q063_age
df2.q063_age.value_counts(dropna=False)
#+end_src
** Check NaNs
#+begin_src jupyter-python :async yes
disp_df(df2[df2.final_q002_ID.isna()])
#+end_src

** Drop incomplete cases
#+begin_src jupyter-python :async yes
df3 = df2[~df2.final_q002_ID.isna()].copy()

log0.info(f"{df3.shape = }")
disp_df(df3.head(n=8).sort_index(), width=4444)
#+end_src

** Age 2
#+begin_src jupyter-python :async yes
# q061_gender
# q063_age
df3["q063_age"] = df3.q063_age.apply(int)

log0.info(f"{df3.q063_age.mean()}")
log0.info(f"{df3.q063_age.std()}")
log0.info(f"{df3.q063_age.min()}")
log0.info(f"{df3.q063_age.max()}")
#+end_src
** Gender
#+begin_src jupyter-python :async yes
df3.q061_gender.value_counts()
#+end_src

** Prepare Data for the Long Format (MELT)
#+begin_src jupyter-python :async yes
sent8 = sorted([col0 for col0 in df2.columns if col0.startswith("MAIN_")])
cols8 = ["PROLIFIC_PID"] + sent8
df8 = df2[cols8].copy()
map8 = {
    "very anti-agentic": -3,
    "anti-agentic": -2,
    "slightly anti-agentic": -1,
    "agency-neutral": 0,
    "slightly pro-agentic": 1,
    "pro-agentic": 2,
    "very pro-agentic": 3,
}
df8.replace(map8, inplace=True)
df8.rename("r{}".format, inplace=True)
df8[sent8].T.to_csv(dir0/"wide_trans_raw.csv", index=False)

log0.info(f"{df8.shape = }")
disp_df(df8, width=4444)
#+end_src

** Long format (MELT)
#+begin_src jupyter-python :async yes
df9 = pd.wide_to_long(df8, stubnames="MAIN_", i="PROLIFIC_PID", j="SENT", sep='', suffix='\\d+').reset_index(drop=False)
df9.dropna(inplace=True, subset="MAIN_")
df9.rename(columns={"MAIN_":"EVAL", "PROLIFIC_PID":"PID"}, inplace=True)

srsly.write_jsonl(dir0/"fact_PID.txt", sorted(df9["PID"].unique().tolist()))
srsly.write_jsonl(dir0/"fact_SENT.txt", sorted(df9["SENT"].unique().tolist()))
for if0 in dir0.glob("fact_*.txt"):
    # log0.info(f"proc: {if0}")
    with open(if0, "r") as fh: text8 = fh.read()
    text8 = text8.replace('\"', '')
    with open(if0, "w") as fh: fh.write(text8)

df9.to_csv(dir0/"long.csv", index=False)
log0.info(f"{df9.shape = }")
disp_df(df9, width=4444)
#+end_src

** Save questions as well
#+begin_src jupyter-python :async yes
srsly.write_json("../../data/u0005-qualtrics-results/questions.json", dc4)

#+end_src

** Check column descriptions
#+begin_src jupyter-python :async yes
print(srsly.yaml_dumps(dc0))

#+end_src
** Check column descriptions
#+begin_src jupyter-python :async yes
print(srsly.yaml_dumps(dc4))
#+end_src

** Check values
#+begin_src jupyter-python :async yes
map2 = {
    "very anti-agentic": -3,
    "anti-agentic": -2,
    "slightly anti-agentic": -1,
    "agency-neutral": 0,
    "slightly pro-agentic": 1,
    "pro-agentic": 2,
    "very pro-agentic": 3,
}
df2.replace(map2, inplace=True)
df2.MAIN_218.value_counts()
#+end_src

** Columns
#+begin_src jupyter-python :async yes
cols2 = sorted([col2 for col2 in df2.columns if col2.startswith("MAIN_")])
len(cols2)
df3a = df2[cols2].describe().T
df3b = df3a[["mean", "std", "min", "max"]].copy()
df3b = df3b.sort_values(by="std")
df3b.rename(index=dc4, inplace=True)
disp_df(df3a, max_rows=444)
#+end_src

#+RESULTS:
#+begin_example
          count      mean       std  min   25%  50%   75%  max
MAIN_001   30.0 -0.866667  1.195778 -3.0 -2.00 -1.0  0.00  1.0
MAIN_002   29.0 -2.137931  0.953345 -3.0 -3.00 -2.0 -2.00  0.0
MAIN_003   30.0 -1.633333  1.325697 -3.0 -3.00 -2.0 -1.00  2.0
MAIN_004   31.0 -2.322581  0.652538 -3.0 -3.00 -2.0 -2.00 -1.0
MAIN_005   30.0 -2.133333  1.224276 -3.0 -3.00 -2.5 -2.00  2.0
MAIN_006   29.0 -0.551724  0.783135 -2.0 -1.00  0.0  0.00  0.0
MAIN_007   30.0 -1.166667  0.949894 -3.0 -2.00 -1.0 -1.00  2.0
MAIN_008   31.0  2.290323  0.642575  0.0  2.00  2.0  3.00  3.0
MAIN_009   29.0 -1.586207  0.779984 -3.0 -2.00 -2.0 -1.00  0.0
MAIN_010   31.0  1.161290  0.734701  0.0  1.00  1.0  1.00  3.0
MAIN_011   30.0  2.333333  0.606478  1.0  2.00  2.0  3.00  3.0
MAIN_012   30.0  0.000000  0.371391 -1.0  0.00  0.0  0.00  1.0
MAIN_013   29.0  2.551724  0.685889  0.0  2.00  3.0  3.00  3.0
MAIN_014   31.0 -0.129032  1.454692 -3.0 -1.00  0.0  1.00  2.0
MAIN_015   31.0 -0.161290  1.067607 -2.0 -1.00  0.0  0.00  2.0
MAIN_016   30.0 -1.166667  1.205829 -3.0 -2.00 -1.0  0.00  1.0
MAIN_017   30.0  0.033333  0.182574  0.0  0.00  0.0  0.00  1.0
MAIN_018   31.0  0.096774  0.650889 -2.0  0.00  0.0  0.00  1.0
MAIN_019   31.0  2.645161  0.550659  1.0  2.00  3.0  3.00  3.0
MAIN_020   30.0 -2.166667  0.647719 -3.0 -3.00 -2.0 -2.00 -1.0
MAIN_021   31.0  2.483871  0.569852  1.0  2.00  3.0  3.00  3.0
MAIN_022   31.0  1.000000  0.816497  0.0  0.00  1.0  2.00  2.0
MAIN_023   30.0  2.066667  0.691492  0.0  2.00  2.0  2.00  3.0
MAIN_024   29.0  2.137931  0.580895  1.0  2.00  2.0  2.00  3.0
MAIN_025   29.0  2.655172  0.552647  1.0  2.00  3.0  3.00  3.0
MAIN_026   30.0  1.533333  1.008014 -1.0  1.00  1.5  2.00  3.0
MAIN_027   30.0  0.066667  0.449776 -1.0  0.00  0.0  0.00  2.0
MAIN_028   30.0  2.000000  0.909718  0.0  1.25  2.0  3.00  3.0
MAIN_029   30.0  2.266667  0.639684  1.0  2.00  2.0  3.00  3.0
MAIN_030   30.0 -1.200000  1.540264 -3.0 -2.00 -2.0  0.00  2.0
MAIN_031   30.0  2.200000  0.610257  1.0  2.00  2.0  3.00  3.0
MAIN_032   31.0 -1.935484  0.629046 -3.0 -2.00 -2.0 -2.00 -1.0
MAIN_033   29.0 -2.137931  0.639427 -3.0 -3.00 -2.0 -2.00 -1.0
MAIN_034   30.0  2.133333  0.628810  1.0  2.00  2.0  2.75  3.0
MAIN_035   30.0  2.600000  0.563242  1.0  2.00  3.0  3.00  3.0
MAIN_036   30.0 -1.266667  1.142693 -3.0 -2.00 -1.0  0.00  1.0
MAIN_037   29.0  0.551724  1.403725 -3.0  0.00  0.0  1.00  3.0
MAIN_038   30.0  1.966667  0.614948  1.0  2.00  2.0  2.00  3.0
MAIN_039   30.0 -2.466667  0.571346 -3.0 -3.00 -2.5 -2.00 -1.0
MAIN_040   30.0 -2.433333  0.727932 -3.0 -3.00 -3.0 -2.00 -1.0
MAIN_041   30.0 -0.733333  1.284747 -3.0 -2.00 -1.0  0.00  2.0
MAIN_042   29.0  0.206897  0.675030 -1.0  0.00  0.0  0.00  3.0
MAIN_043   30.0 -0.100000  0.803012 -2.0  0.00  0.0  0.00  2.0
MAIN_044   30.0  2.533333  0.507416  2.0  2.00  3.0  3.00  3.0
MAIN_045   29.0  1.034483  1.451176 -2.0  1.00  1.0  2.00  3.0
MAIN_046   30.0  2.800000  0.406838  2.0  3.00  3.0  3.00  3.0
MAIN_047   30.0  0.100000  0.402578  0.0  0.00  0.0  0.00  2.0
MAIN_048   30.0  0.600000  1.162637 -2.0  0.00  0.0  1.00  3.0
MAIN_049   31.0 -1.129032  1.258092 -3.0 -2.00 -1.0  0.00  2.0
MAIN_050   29.0 -1.103448  1.263352 -3.0 -2.00 -1.0  0.00  1.0
MAIN_051   30.0 -1.333333  0.802296 -3.0 -2.00 -1.0 -1.00  0.0
MAIN_052   29.0  2.103448  0.724314  0.0  2.00  2.0  3.00  3.0
MAIN_053   30.0  2.200000  0.714384  0.0  2.00  2.0  3.00  3.0
MAIN_054   31.0 -2.193548  0.980454 -3.0 -3.00 -2.0 -2.00  0.0
MAIN_055   31.0 -1.096774  1.164899 -3.0 -2.00 -1.0  0.00  0.0
MAIN_056   31.0 -2.419355  0.620440 -3.0 -3.00 -2.0 -2.00 -1.0
MAIN_057   31.0 -1.677419  1.399693 -3.0 -3.00 -2.0 -1.00  2.0
MAIN_058   29.0  0.034483  0.185695  0.0  0.00  0.0  0.00  1.0
MAIN_059   30.0 -2.166667  0.791478 -3.0 -3.00 -2.0 -2.00  0.0
MAIN_060   30.0  0.466667  0.628810  0.0  0.00  0.0  1.00  2.0
MAIN_061   29.0  1.379310  0.978840  0.0  1.00  1.0  2.00  3.0
MAIN_062   31.0  2.225806  0.844972 -1.0  2.00  2.0  3.00  3.0
MAIN_063   29.0 -1.758621  1.090713 -3.0 -2.00 -2.0 -2.00  2.0
MAIN_064   29.0  0.724138  1.031523  0.0  0.00  0.0  2.00  3.0
MAIN_065   30.0 -1.300000  0.876907 -3.0 -2.00 -1.0 -1.00  0.0
MAIN_066   30.0 -2.400000  0.621455 -3.0 -3.00 -2.0 -2.00 -1.0
MAIN_067   31.0  1.838710  0.778750  0.0  1.00  2.0  2.00  3.0
MAIN_068   31.0  0.645161  0.950382 -1.0  0.00  0.0  1.00  3.0
MAIN_069   30.0 -0.133333  1.041661 -3.0 -0.75  0.0  0.00  2.0
MAIN_070   30.0 -2.000000  0.787839 -3.0 -2.75 -2.0 -2.00  0.0
MAIN_071   30.0 -1.333333  1.347625 -3.0 -2.00 -1.5 -1.00  2.0
MAIN_072   30.0  0.433333  0.727932  0.0  0.00  0.0  1.00  2.0
MAIN_073   29.0  0.827586  0.928477  0.0  0.00  1.0  2.00  3.0
MAIN_074   30.0  2.066667  0.583292  1.0  2.00  2.0  2.00  3.0
MAIN_075   29.0  2.172414  0.928477  0.0  2.00  2.0  3.00  3.0
MAIN_076   30.0  1.466667  0.973204  0.0  1.00  1.0  2.00  3.0
MAIN_077   30.0 -0.800000  1.156690 -3.0 -1.00 -1.0  0.00  1.0
MAIN_078   29.0 -1.724138  0.921821 -3.0 -2.00 -2.0 -1.00  0.0
MAIN_079   30.0 -0.033333  0.718395 -2.0  0.00  0.0  0.00  1.0
MAIN_080   30.0  0.700000  1.055364 -1.0  0.00  1.0  1.00  3.0
MAIN_081   30.0  0.400000  0.770132  0.0  0.00  0.0  0.75  3.0
MAIN_082   31.0  1.677419  0.944708 -1.0  1.00  2.0  2.00  3.0
MAIN_083   30.0  1.133333  1.041661 -1.0  1.00  1.0  2.00  3.0
MAIN_084   30.0  1.666667  1.268541 -2.0  1.00  2.0  2.75  3.0
MAIN_085   30.0  1.966667  0.614948  1.0  2.00  2.0  2.00  3.0
MAIN_086   29.0  0.586207  1.323341 -2.0  0.00  1.0  1.00  3.0
MAIN_087   30.0  1.733333  1.080655 -1.0  1.00  2.0  2.75  3.0
MAIN_088   29.0 -1.103448  1.175489 -3.0 -2.00 -1.0 -1.00  1.0
MAIN_089   31.0 -0.645161  1.018115 -3.0 -1.00 -1.0  0.00  1.0
MAIN_090   31.0 -0.774194  1.055452 -3.0 -1.00 -1.0  0.00  2.0
MAIN_091   30.0 -1.033333  1.066200 -3.0 -2.00 -1.0  0.00  1.0
MAIN_092   30.0 -1.800000  1.214851 -3.0 -3.00 -2.0 -1.00  1.0
MAIN_093   31.0 -2.483871  0.625618 -3.0 -3.00 -3.0 -2.00 -1.0
MAIN_094   31.0  1.612903  0.843699  0.0  1.00  2.0  2.00  3.0
MAIN_095   29.0 -2.000000  0.534522 -3.0 -2.00 -2.0 -2.00 -1.0
MAIN_096   31.0 -0.451613  1.120676 -3.0 -1.00  0.0  0.00  2.0
MAIN_097   30.0 -1.866667  0.776079 -3.0 -2.00 -2.0 -1.00  0.0
MAIN_098   30.0  0.533333  1.008014 -2.0  0.00  0.0  1.00  3.0
MAIN_099   30.0  2.066667  0.827682 -1.0  2.00  2.0  2.75  3.0
MAIN_100   31.0  2.161290  0.934408 -1.0  2.00  2.0  3.00  3.0
MAIN_101   31.0 -0.161290  0.582911 -3.0  0.00  0.0  0.00  0.0
MAIN_102   30.0 -1.466667  1.502488 -3.0 -3.00 -1.5 -1.00  3.0
MAIN_103   30.0  2.200000  0.550861  1.0  2.00  2.0  2.75  3.0
MAIN_104   31.0  1.161290  1.293491 -2.0  1.00  1.0  2.00  3.0
MAIN_105   29.0 -1.862069  0.742781 -3.0 -2.00 -2.0 -2.00  0.0
MAIN_106   30.0  0.400000  0.563242 -1.0  0.00  0.0  1.00  1.0
MAIN_107   31.0  0.096774  0.396219  0.0  0.00  0.0  0.00  2.0
MAIN_108   30.0  2.300000  0.702213  0.0  2.00  2.0  3.00  3.0
MAIN_109   29.0  2.517241  1.153278 -3.0  2.00  3.0  3.00  3.0
MAIN_110   31.0  0.354839  0.550659 -1.0  0.00  0.0  1.00  1.0
MAIN_111   30.0 -0.333333  0.758098 -3.0  0.00  0.0  0.00  0.0
MAIN_112   30.0 -1.900000  0.994814 -3.0 -2.75 -2.0 -2.00  1.0
MAIN_113   31.0  1.774194  0.844972  0.0  1.00  2.0  2.00  3.0
MAIN_114   30.0  1.066667  0.907187 -1.0  0.25  1.0  2.00  3.0
MAIN_115   31.0  1.709677  0.937854 -1.0  1.00  2.0  2.00  3.0
MAIN_116   30.0 -0.400000  0.968468 -3.0 -0.75  0.0  0.00  2.0
MAIN_117   31.0  1.290323  1.243478 -2.0  1.00  2.0  2.00  3.0
MAIN_118   30.0  1.233333  1.040004  0.0  0.00  1.0  2.00  3.0
MAIN_119   29.0  1.896552  0.724314  0.0  2.00  2.0  2.00  3.0
MAIN_120   29.0  0.275862  1.250616 -2.0  0.00  0.0  1.00  3.0
MAIN_121   31.0 -0.967742  1.048296 -3.0 -2.00 -1.0  0.00  0.0
MAIN_122   30.0 -0.100000  0.884736 -3.0  0.00  0.0  0.00  3.0
MAIN_123   30.0  0.233333  0.858360 -2.0  0.00  0.0  0.00  3.0
MAIN_124   30.0 -1.566667  1.040004 -3.0 -2.00 -2.0 -1.00  0.0
MAIN_125   30.0 -0.533333  0.776079 -3.0 -1.00  0.0  0.00  1.0
MAIN_126   30.0  1.133333  0.899553 -1.0  1.00  1.0  2.00  3.0
MAIN_127   29.0  0.827586  0.928477  0.0  0.00  1.0  1.00  3.0
MAIN_128   30.0  1.866667  0.860366  0.0  1.00  2.0  2.00  3.0
MAIN_129   30.0 -0.800000  0.996546 -3.0 -1.75  0.0  0.00  0.0
MAIN_130   30.0 -2.100000  0.803012 -3.0 -3.00 -2.0 -2.00  0.0
MAIN_131   30.0  0.666667  0.958927  0.0  0.00  0.0  1.00  3.0
MAIN_132   30.0  1.133333  1.195778 -2.0  0.25  1.0  2.00  3.0
MAIN_133   30.0  1.966667  0.964305 -2.0  2.00  2.0  2.00  3.0
MAIN_134   29.0 -1.655172  1.232763 -3.0 -3.00 -2.0 -1.00  1.0
MAIN_135   30.0  0.066667  0.365148 -1.0  0.00  0.0  0.00  1.0
MAIN_136   30.0 -0.333333  0.758098 -3.0 -0.75  0.0  0.00  1.0
MAIN_137   30.0  2.133333  1.074255 -1.0  2.00  2.0  3.00  3.0
MAIN_138   29.0  1.586207  1.210585 -2.0  1.00  2.0  2.00  3.0
MAIN_139   30.0 -2.533333  0.730297 -3.0 -3.00 -3.0 -2.00  0.0
MAIN_140   30.0  0.066667  1.337350 -3.0  0.00  0.0  1.00  3.0
MAIN_141   30.0 -2.366667  0.764890 -3.0 -3.00 -2.5 -2.00  0.0
MAIN_142   30.0 -1.700000  1.055364 -3.0 -2.75 -2.0 -1.00  0.0
MAIN_143   29.0  2.517241  0.574499  1.0  2.00  3.0  3.00  3.0
MAIN_144   30.0  0.566667  0.935261 -2.0  0.00  0.0  1.00  3.0
MAIN_145   30.0  0.433333  1.135124 -2.0  0.00  1.0  1.00  2.0
MAIN_146   29.0  1.413793  1.052794  0.0  0.00  2.0  2.00  3.0
MAIN_147   30.0  2.366667  0.850287  0.0  2.00  3.0  3.00  3.0
MAIN_148   31.0 -1.516129  1.313290 -3.0 -2.00 -2.0 -1.00  2.0
MAIN_149   29.0  1.862069  0.639427  1.0  1.00  2.0  2.00  3.0
MAIN_150   31.0 -0.161290  0.373878 -1.0  0.00  0.0  0.00  0.0
MAIN_151   30.0  2.033333  0.850287  0.0  2.00  2.0  3.00  3.0
MAIN_152   29.0  0.068966  0.257881  0.0  0.00  0.0  0.00  1.0
MAIN_153   31.0 -0.419355  1.204829 -3.0 -1.00  0.0  0.00  3.0
MAIN_154   31.0  0.677419  1.012821 -2.0  0.00  0.0  1.00  3.0
MAIN_155   30.0 -0.366667  1.033352 -3.0 -0.75  0.0  0.00  2.0
MAIN_156   31.0  1.903226  0.789719  0.0  2.00  2.0  2.00  3.0
MAIN_157   30.0  1.666667  1.061337 -3.0  1.00  2.0  2.00  3.0
MAIN_158   29.0  0.241379  0.576639  0.0  0.00  0.0  0.00  2.0
MAIN_159   30.0 -0.433333  1.590561 -3.0 -2.00 -1.0  1.00  3.0
MAIN_160   29.0  1.655172  0.856732 -1.0  1.00  2.0  2.00  3.0
MAIN_161   30.0  1.100000  1.093870 -2.0  1.00  1.0  2.00  3.0
MAIN_162   31.0 -1.741935  0.998924 -3.0 -2.00 -2.0 -1.00  1.0
MAIN_163   30.0  2.233333  0.773854  0.0  2.00  2.0  3.00  3.0
MAIN_164   29.0  0.310345  0.603765  0.0  0.00  0.0  0.00  2.0
MAIN_165   31.0  0.935484  1.062559  0.0  0.00  1.0  2.00  3.0
MAIN_166   30.0 -1.700000  0.952311 -3.0 -2.00 -2.0 -1.00  0.0
MAIN_167   30.0  1.900000  0.959526 -1.0  1.25  2.0  2.75  3.0
MAIN_168   31.0  0.419355  0.672022  0.0  0.00  0.0  1.00  2.0
MAIN_169   31.0 -0.741935  1.094463 -3.0 -1.50  0.0  0.00  1.0
MAIN_170   31.0 -1.870968  0.957146 -3.0 -3.00 -2.0 -1.00  1.0
MAIN_171   31.0 -0.580645  1.088552 -3.0 -1.00  0.0  0.00  2.0
MAIN_172   30.0 -1.666667  0.922266 -3.0 -2.00 -2.0 -1.00  1.0
MAIN_173   30.0  2.266667  0.691492  1.0  2.00  2.0  3.00  3.0
MAIN_174   30.0 -2.033333  0.764890 -3.0 -2.75 -2.0 -2.00  0.0
MAIN_175   30.0  0.433333  0.727932  0.0  0.00  0.0  1.00  2.0
MAIN_176   31.0 -0.677419  0.908739 -3.0 -1.00 -1.0  0.00  1.0
MAIN_177   31.0  2.387097  0.615219  1.0  2.00  2.0  3.00  3.0
MAIN_178   30.0  0.000000  0.000000  0.0  0.00  0.0  0.00  0.0
MAIN_179   29.0  2.310345  0.712313  1.0  2.00  2.0  3.00  3.0
MAIN_180   30.0 -2.033333  0.718395 -3.0 -2.75 -2.0 -2.00 -1.0
MAIN_181   30.0  1.700000  1.764594 -3.0  2.00  2.0  3.00  3.0
MAIN_182   31.0 -0.225806  0.762001 -2.0 -1.00  0.0  0.00  1.0
MAIN_183   30.0 -0.900000  1.322224 -3.0 -2.00 -0.5  0.00  2.0
MAIN_184   30.0 -0.633333  1.245221 -3.0 -1.00 -1.0  0.00  2.0
MAIN_185   29.0 -0.172414  1.489702 -3.0 -1.00  0.0  1.00  3.0
MAIN_186   30.0  1.233333  1.165106 -3.0  1.00  1.5  2.00  3.0
MAIN_187   31.0 -1.322581  0.979357 -3.0 -2.00 -1.0 -1.00  0.0
MAIN_188   30.0 -0.600000  1.069966 -3.0 -1.00  0.0  0.00  1.0
MAIN_189   29.0 -1.689655  1.490528 -3.0 -3.00 -2.0 -1.00  3.0
MAIN_190   30.0 -1.166667  1.341212 -3.0 -2.00 -2.0 -1.00  1.0
MAIN_191   29.0 -1.379310  1.082781 -3.0 -2.00 -1.0 -1.00  2.0
MAIN_192   30.0  1.900000  0.661764  1.0  1.25  2.0  2.00  3.0
MAIN_193   30.0  0.166667  1.510500 -3.0 -1.00  1.0  1.00  2.0
MAIN_194   30.0 -0.266667  1.387961 -3.0 -1.00 -0.5  1.00  3.0
MAIN_195   29.0  1.551724  1.088453 -1.0  1.00  2.0  2.00  3.0
MAIN_196   30.0 -1.100000  1.124952 -2.0 -2.00 -1.0 -1.00  2.0
MAIN_197   29.0  0.172414  1.712746 -3.0 -1.00  1.0  2.00  3.0
MAIN_198   29.0 -0.517241  1.271127 -3.0 -1.00  0.0  0.00  2.0
MAIN_199   31.0 -0.387097  1.520470 -3.0 -2.00 -1.0  1.00  3.0
MAIN_200   29.0 -1.689655  0.712313 -3.0 -2.00 -2.0 -1.00  0.0
MAIN_201   30.0 -1.866667  0.860366 -3.0 -2.00 -2.0 -1.00  0.0
MAIN_202   30.0 -2.300000  0.651259 -3.0 -3.00 -2.0 -2.00  0.0
MAIN_203   31.0 -0.064516  0.359211 -2.0  0.00  0.0  0.00  0.0
MAIN_204   30.0 -2.033333  0.668675 -3.0 -2.00 -2.0 -2.00 -1.0
MAIN_205   31.0  1.322581  0.871286  0.0  1.00  2.0  2.00  3.0
MAIN_206   30.0  0.266667  1.484014 -3.0 -1.00  0.0  2.00  2.0
MAIN_207   30.0  1.500000  0.731083  0.0  1.00  2.0  2.00  3.0
MAIN_208   30.0  2.200000  0.761124  1.0  2.00  2.0  3.00  3.0
MAIN_209   30.0  2.000000  0.946864  0.0  2.00  2.0  3.00  3.0
MAIN_210   29.0 -1.827586  0.804850 -3.0 -2.00 -2.0 -2.00  0.0
MAIN_211   30.0  0.000000  0.000000  0.0  0.00  0.0  0.00  0.0
MAIN_212   29.0 -0.965517  0.865314 -3.0 -2.00 -1.0  0.00  0.0
MAIN_213   30.0 -0.833333  1.147211 -3.0 -2.00 -0.5  0.00  1.0
MAIN_214   31.0  0.322581  1.076634 -2.0  0.00  1.0  1.00  2.0
MAIN_215   30.0 -0.966667  1.188547 -3.0 -1.75 -1.0  0.00  1.0
MAIN_216   31.0 -2.129032  0.763411 -3.0 -3.00 -2.0 -2.00 -1.0
MAIN_217   30.0 -0.033333  0.413841 -2.0  0.00  0.0  0.00  1.0
MAIN_218   30.0 -1.200000  0.886683 -3.0 -2.00 -1.0 -1.00  0.0
MAIN_219   30.0 -0.800000  1.323527 -3.0 -2.00 -1.0  0.00  1.0
MAIN_220   29.0  1.689655  1.072495  0.0  1.00  2.0  3.00  3.0
MAIN_221   30.0 -0.033333  0.556053 -2.0  0.00  0.0  0.00  1.0
MAIN_222   30.0 -1.600000  0.621455 -3.0 -2.00 -2.0 -1.00  0.0
MAIN_223   29.0  1.344828  1.369981 -2.0  1.00  2.0  2.00  3.0
MAIN_224   30.0 -1.133333  1.795268 -3.0 -3.00 -1.5  0.00  3.0
MAIN_225   30.0 -1.900000  0.607425 -3.0 -2.00 -2.0 -2.00 -1.0
MAIN_226   31.0 -1.838710  1.035914 -3.0 -3.00 -2.0 -1.00  0.0
MAIN_227   30.0  2.266667  1.201532 -3.0  2.00  2.5  3.00  3.0
MAIN_228   30.0 -0.966667  1.325697 -3.0 -2.00 -1.0  0.00  3.0
MAIN_229   29.0 -0.689655  0.849514 -2.0 -1.00 -1.0  0.00  1.0
MAIN_230   30.0 -2.466667  0.571346 -3.0 -3.00 -2.5 -2.00 -1.0
MAIN_231   29.0 -2.482759  0.508548 -3.0 -3.00 -2.0 -2.00 -2.0
MAIN_232   30.0 -2.366667  0.718395 -3.0 -3.00 -2.0 -2.00  0.0
MAIN_233   31.0  0.193548  0.601074 -1.0  0.00  0.0  0.00  2.0
MAIN_234   30.0  0.100000  0.607425 -1.0  0.00  0.0  0.00  2.0
MAIN_235   30.0  0.000000  0.587220 -2.0  0.00  0.0  0.00  2.0
MAIN_236   29.0  2.103448  0.673203  1.0  2.00  2.0  3.00  3.0
MAIN_237   30.0 -1.700000  0.987857 -3.0 -2.00 -2.0 -1.00  0.0
MAIN_238   29.0  2.103448  0.816999  0.0  2.00  2.0  3.00  3.0
MAIN_239   30.0 -0.033333  0.319842 -1.0  0.00  0.0  0.00  1.0
MAIN_240   30.0  2.100000  0.758856  0.0  2.00  2.0  3.00  3.0
MAIN_241   30.0  2.133333  0.776079  0.0  2.00  2.0  3.00  3.0
MAIN_242   31.0  0.774194  0.804557 -1.0  0.00  1.0  1.00  2.0
MAIN_243   31.0  2.322581  0.599283  1.0  2.00  2.0  3.00  3.0
MAIN_244   31.0  0.032258  0.179605  0.0  0.00  0.0  0.00  1.0
MAIN_245   30.0 -2.466667  0.973204 -3.0 -3.00 -3.0 -2.00  1.0
MAIN_246   29.0 -0.379310  1.521601 -3.0 -1.00 -1.0  1.00  2.0
MAIN_247   29.0  1.379310  1.656455 -3.0  1.00  2.0  3.00  3.0
MAIN_248   29.0  2.137931  0.639427  1.0  2.00  2.0  3.00  3.0
MAIN_249   30.0  1.333333  1.241060 -1.0  0.25  2.0  2.00  3.0
MAIN_250   30.0  0.066667  0.365148  0.0  0.00  0.0  0.00  2.0
MAIN_251   30.0 -0.900000  1.295882 -3.0 -2.00 -1.0  0.00  2.0
MAIN_252   30.0  2.600000  0.498273  2.0  2.00  3.0  3.00  3.0
MAIN_253   31.0  1.096774  1.044185 -1.0  0.00  1.0  2.00  3.0
MAIN_254   30.0  1.466667  0.819307  0.0  1.00  2.0  2.00  3.0
MAIN_255   30.0 -2.366667  0.718395 -3.0 -3.00 -2.5 -2.00 -1.0
MAIN_256   30.0 -1.733333  1.142693 -3.0 -2.00 -2.0 -1.00  1.0
MAIN_257   30.0  2.000000  0.694808  1.0  2.00  2.0  2.00  3.0
MAIN_258   29.0  0.000000  0.000000  0.0  0.00  0.0  0.00  0.0
MAIN_259   30.0  1.133333  1.136642  0.0  0.00  1.0  2.00  3.0
MAIN_260   29.0 -0.758621  1.902164 -3.0 -2.00 -1.0  1.00  3.0
MAIN_261   29.0 -0.241379  1.327058 -3.0 -1.00  0.0  1.00  2.0
MAIN_262   29.0  2.172414  0.539111  1.0  2.00  2.0  2.00  3.0
MAIN_263   29.0  1.206897  0.940338  0.0  0.00  1.0  2.00  3.0
MAIN_264   30.0  0.400000  0.813676 -1.0  0.00  0.0  1.00  3.0
MAIN_265   29.0  2.379310  0.561490  1.0  2.00  2.0  3.00  3.0
MAIN_266   30.0 -0.433333  1.165106 -2.0 -1.00 -1.0  1.00  2.0
MAIN_267   29.0 -0.448276  1.212618 -3.0 -1.00  0.0  0.00  2.0
MAIN_268   29.0  1.379310  0.978840  0.0  1.00  1.0  2.00  3.0
MAIN_269   30.0  0.733333  0.868345  0.0  0.00  0.5  1.00  3.0
MAIN_270   30.0 -0.466667  1.252125 -3.0 -1.00  0.0  0.00  2.0
MAIN_271   30.0 -0.366667  0.850287 -3.0  0.00  0.0  0.00  1.0
MAIN_272   30.0 -0.633333  1.098065 -3.0 -1.00  0.0  0.00  2.0
MAIN_273   31.0 -0.419355  0.672022 -2.0 -1.00  0.0  0.00  0.0
MAIN_274   30.0 -0.433333  1.430778 -3.0 -1.00  0.0  0.00  3.0
MAIN_275   30.0  1.566667  0.897634 -1.0  1.00  2.0  2.00  3.0
MAIN_276   30.0  2.733333  0.449776  2.0  2.25  3.0  3.00  3.0
MAIN_277   30.0  2.133333  0.681445  1.0  2.00  2.0  3.00  3.0
MAIN_278   29.0 -2.206897  0.901559 -3.0 -3.00 -2.0 -2.00  1.0
MAIN_279   30.0  2.233333  0.727932  1.0  2.00  2.0  3.00  3.0
MAIN_280   31.0  1.516129  0.889605  0.0  1.00  2.0  2.00  3.0
MAIN_281   31.0  0.580645  0.958269  0.0  0.00  0.0  1.00  3.0
MAIN_282   30.0 -0.300000  0.702213 -2.0  0.00  0.0  0.00  1.0
MAIN_283   30.0  1.733333  0.739680  0.0  1.00  2.0  2.00  3.0
MAIN_284   31.0 -1.967742  0.836017 -3.0 -3.00 -2.0 -1.00  0.0
MAIN_285   31.0 -1.451613  1.337627 -3.0 -2.00 -2.0 -1.00  2.0
MAIN_286   30.0  1.166667  0.912871 -1.0  1.00  1.0  2.00  3.0
MAIN_287   30.0  0.866667  0.860366  0.0  0.00  1.0  2.00  2.0
MAIN_288   29.0 -2.172414  0.889180 -3.0 -3.00 -2.0 -2.00  0.0
MAIN_289   30.0 -2.000000  0.830455 -3.0 -3.00 -2.0 -1.00 -1.0
MAIN_290   31.0  2.354839  0.660726  1.0  2.00  2.0  3.00  3.0
MAIN_291   30.0 -1.833333  0.912871 -3.0 -2.00 -2.0 -1.00  0.0
MAIN_292   30.0  0.400000  0.770132 -2.0  0.00  0.0  1.00  2.0
MAIN_293   31.0  0.161290  0.860108 -2.0  0.00  0.0  1.00  2.0
MAIN_294   30.0  1.866667  1.136642 -1.0  1.00  2.0  3.00  3.0
MAIN_295   30.0  2.066667  0.739680  1.0  2.00  2.0  3.00  3.0
MAIN_296   30.0  1.133333  0.973204  0.0  0.00  1.0  2.00  3.0
MAIN_297   29.0 -2.034483  0.778403 -3.0 -3.00 -2.0 -1.00 -1.0
MAIN_298   30.0 -2.333333  0.660895 -3.0 -3.00 -2.0 -2.00 -1.0
MAIN_299   30.0 -2.133333  0.730297 -3.0 -3.00 -2.0 -2.00  0.0
MAIN_300   30.0 -2.233333  1.304722 -3.0 -3.00 -3.0 -2.00  3.0
#+end_example
** Heatmap
#+begin_src jupyter-python :async yes
fig = go.Figure(data=go.Heatmap(
    z=df3b,
    x=df3b.columns,
    y=df3b.index,
    # colorscale=corr_colors0,
    text=df3b.to_numpy(),
    texttemplate="%{text:.2f}",
    textfont={"size":11},
    zmin=-3,
    zmid=0,
    zmax=3,
))

fig.update_yaxes(autorange="reversed")
fig.update_xaxes(side="top")
fig.write_html("fig_002_ratings.html")

#+end_src
** Heatmap from pandas
#+begin_src jupyter-python :async yes
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from matplotlib import colors

cm = sns.diverging_palette(5, 250, as_cmap=True)

def background_gradient(s, m, M, cmap='PuBu', low=0, high=0):
    rng = M - m
    norm = colors.Normalize(m - (rng * low),
                            M + (rng * high))
    normed = norm(s.values)
    c = [colors.rgb2hex(x) for x in plt.cm.get_cmap(cmap)(normed)]
    return ['background-color: %s' % color for color in c]

even_range = np.max([np.abs(df3b.values.min()), np.abs(df3b.values.max())])

df3b_str = df3b.style.apply(
    background_gradient,
    cmap=cm,
    m=-even_range,
    M=even_range,
).set_precision(2).render()
# this method is deprecated in favour of `Styler.format(precision=..)`
# this method is deprecated in favour of `Styler.to_html()`

log0.info(f"{type(df3b_str) = }")
log0.info(f"{len(df3b_str) = }")

of0 = "fig_004_test.html"
with open(of0, "w") as fh:
    fh.write(df3b_str)

#+end_src
* Check agreement
** Select data
#+begin_src jupyter-python :async yes
df4 = df2[cols2].T
log0.info(f"{df4.shape = }")
disp_df(df4)
#+end_src

#+RESULTS:
:RESULTS:
: I: df4.shape = (300, 96)
#+begin_example
           0    1    2    3    4    5    6    7    8    9    10  11   12   13   14   15   16   17   18   19   20   21   22   23   24   25   26   27   28   29   30   31   32   33   34   35   36   37   38   39   40   41   42   43   44  45  46   47   48   49   50   51   52   53   54   55   56   57   58   59   60   61   62   63   64   65   66   67  68   69   70   71   72   73  74   75   76  77   78   79   80   81   82   83   84   85   86   87   88   89   90   91   92   93   94   95
MAIN_001 -2.0  NaN  NaN  NaN  NaN  NaN -2.0  0.0  NaN  NaN  0.0 NaN  NaN  0.0  NaN  NaN  NaN  1.0 -1.0 -2.0  NaN  NaN  NaN  NaN  0.0  1.0  NaN  NaN  NaN  0.0  NaN  NaN  NaN  NaN  NaN  NaN  NaN -1.0  NaN  NaN -1.0  NaN -2.0  NaN  NaN NaN NaN -2.0  0.0  NaN  NaN  NaN  NaN -2.0  NaN -3.0  NaN -1.0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  0.0  NaN -1.0 NaN  NaN  0.0  1.0  NaN  NaN NaN -2.0  NaN NaN  NaN  NaN -3.0  NaN  NaN -2.0 -2.0  NaN  NaN  NaN  1.0  NaN  NaN  NaN -1.0  NaN  NaN  0.0
MAIN_002  NaN -2.0 -3.0  NaN  NaN  NaN  NaN  NaN -2.0  NaN  NaN NaN  NaN -2.0  NaN  NaN -3.0 -2.0  NaN  NaN  NaN -1.0  NaN  NaN  NaN -1.0  NaN -1.0  NaN  NaN  NaN -3.0 -1.0  NaN -3.0  NaN -3.0  NaN  NaN  NaN -2.0 -3.0  NaN  NaN  NaN NaN NaN  NaN  NaN  NaN  NaN -2.0 -3.0  NaN -2.0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN -3.0 -3.0 -3.0  NaN NaN  0.0  NaN  NaN  NaN -3.0 NaN  NaN  NaN NaN -1.0  NaN -3.0  NaN -3.0  NaN  NaN  0.0  NaN -2.0 -2.0  NaN  NaN  NaN  NaN  NaN  NaN  NaN
MAIN_003  NaN  NaN  NaN  NaN  1.0 -1.0  NaN -1.0  NaN -1.0  2.0 NaN  NaN  NaN  NaN -2.0  NaN  NaN  NaN  NaN  NaN  NaN -1.0 -2.0  NaN  NaN  NaN  NaN  NaN  0.0  NaN -1.0 -1.0  NaN  NaN  NaN -3.0 -2.0  NaN  NaN  1.0  NaN  NaN -2.0  NaN NaN NaN -3.0  NaN  NaN  NaN  NaN -3.0  NaN  NaN -3.0 -3.0  NaN  NaN  NaN -1.0  NaN  NaN  NaN -3.0 -2.0  NaN  NaN NaN  NaN  NaN  NaN -1.0 -2.0 NaN  NaN  NaN NaN  NaN -2.0  NaN  NaN -3.0  NaN  NaN -2.0  NaN -2.0 -3.0  NaN  NaN  NaN  NaN -3.0  NaN  NaN
MAIN_004 -2.0  NaN  NaN  NaN  NaN  NaN -1.0 -2.0  NaN  NaN  NaN NaN  NaN -2.0  NaN -2.0 -3.0  NaN  NaN -3.0 -3.0  NaN  NaN -2.0  NaN  NaN -1.0  NaN  NaN -2.0  NaN -3.0 -2.0  NaN  NaN  NaN  NaN -2.0  NaN  NaN  NaN -3.0  NaN  NaN  NaN NaN NaN  NaN  NaN -3.0  NaN  NaN  NaN -1.0 -2.0  NaN  NaN -2.0  NaN  NaN  NaN  NaN  NaN  NaN  NaN -3.0 -3.0  NaN NaN  NaN -3.0 -3.0  NaN -2.0 NaN -2.0  NaN NaN  NaN  NaN -3.0  NaN  NaN -2.0 -2.0  NaN  NaN  NaN  NaN  NaN -3.0 -2.0  NaN  NaN  NaN -3.0
MAIN_005  NaN  NaN  NaN -2.0 -2.0 -1.0  NaN  NaN  NaN -3.0  NaN NaN  NaN  NaN  NaN -2.0 -3.0  NaN  NaN -3.0 -3.0 -2.0  NaN  NaN -3.0  NaN  NaN  NaN  NaN  NaN -1.0 -3.0  NaN  NaN  NaN  NaN  NaN -3.0  NaN  NaN -3.0  NaN  NaN  NaN  NaN NaN NaN  NaN -2.0  NaN  NaN -3.0 -3.0  NaN  NaN  2.0  NaN  NaN -1.0  NaN -3.0 -3.0  NaN -2.0  NaN  NaN  NaN -1.0 NaN  NaN  NaN  NaN  1.0  NaN NaN -2.0  NaN NaN  NaN  NaN -3.0 -3.0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN -3.0  NaN -2.0  NaN -2.0  NaN
MAIN_006  NaN  NaN -2.0  NaN -1.0  NaN  NaN  NaN -1.0  NaN  0.0 NaN  NaN -2.0  NaN -1.0  NaN  NaN  NaN  NaN  NaN  0.0  NaN  NaN  NaN  0.0  NaN  NaN  0.0  NaN  0.0  NaN  NaN  NaN  NaN -1.0  0.0  NaN  NaN -2.0  0.0  NaN  NaN  NaN  NaN NaN NaN  NaN  0.0 -1.0  NaN  NaN  NaN -2.0  0.0  NaN  NaN  NaN  NaN  NaN  NaN  0.0  NaN  NaN  NaN  NaN  0.0  NaN NaN  NaN  0.0  NaN  0.0  NaN NaN  NaN  0.0 NaN  0.0  NaN  NaN  NaN  0.0  NaN  NaN  0.0 -1.0  NaN  NaN  NaN -2.0  0.0  NaN  NaN  NaN  NaN
MAIN_007  NaN -1.0 -1.0 -1.0  NaN  NaN  NaN  NaN  NaN  2.0  NaN NaN  NaN  NaN -1.0  NaN  NaN  NaN  NaN  NaN -1.0 -1.0  NaN  NaN  NaN  NaN -2.0 -1.0  NaN  NaN  NaN  NaN -1.0 -2.0 -3.0  NaN  0.0  NaN  NaN  NaN  NaN  NaN -1.0  NaN  NaN NaN NaN -2.0 -2.0  NaN  NaN  NaN  NaN -2.0 -1.0  NaN  NaN  NaN -2.0  NaN  NaN  NaN  NaN  NaN  NaN -1.0 -2.0 -1.0 NaN  NaN -1.0  NaN -2.0  NaN NaN  NaN  NaN NaN -1.0  NaN -2.0  NaN  NaN -1.0 -1.0  NaN  NaN -1.0  NaN  1.0  NaN  NaN  NaN  NaN  NaN  NaN
MAIN_008  2.0  NaN  2.0  2.0  NaN  NaN  NaN  NaN  NaN  NaN  NaN NaN  3.0  NaN  NaN  2.0  2.0  NaN  NaN  NaN  NaN  2.0  NaN  NaN  NaN  3.0  NaN  2.0  0.0  NaN  NaN  NaN  NaN  NaN  2.0  NaN  NaN  NaN  NaN  3.0  2.0  3.0  NaN  NaN  2.0 NaN NaN  NaN  NaN  2.0  NaN  NaN  3.0  NaN  2.0  NaN  NaN  NaN  NaN  NaN  3.0  3.0  NaN  NaN  3.0  NaN  3.0  NaN NaN  NaN  NaN  NaN  3.0  NaN NaN  NaN  2.0 NaN  2.0  NaN  NaN  NaN  NaN  NaN  2.0  NaN  2.0  3.0  2.0  NaN  NaN  NaN  NaN  NaN  2.0  2.0
MAIN_009  NaN  NaN  NaN  0.0 -1.0 -2.0  NaN  NaN  NaN  0.0 -2.0 NaN  NaN  NaN  NaN  NaN  NaN -2.0  NaN  NaN  NaN -2.0 -1.0  NaN  NaN  NaN  NaN -2.0 -2.0  NaN -2.0 -1.0  NaN  NaN  NaN  NaN  NaN  NaN -2.0  NaN  NaN -3.0  NaN  NaN -2.0 NaN NaN  NaN  NaN  NaN -1.0 -1.0  NaN  NaN -2.0 -3.0  NaN  NaN  NaN -2.0  NaN  NaN  NaN -1.0  NaN  NaN  NaN -2.0 NaN  NaN  NaN  NaN -3.0  NaN NaN  NaN  NaN NaN  NaN -1.0 -1.0 -2.0  NaN  NaN  NaN  NaN  NaN  NaN -1.0  NaN  NaN -1.0  NaN  NaN -1.0  NaN
MAIN_010  NaN  NaN  NaN  NaN  1.0  NaN  1.0  1.0  NaN  NaN  NaN NaN  NaN  0.0  NaN  1.0  1.0  NaN  NaN  NaN  NaN  NaN  NaN  1.0  NaN  2.0  NaN  NaN  0.0  NaN  NaN  NaN  NaN  NaN  1.0  1.0  NaN  NaN  2.0  NaN  NaN  NaN  1.0  2.0  2.0 NaN NaN  1.0  NaN  NaN  NaN  1.0  NaN  1.0  NaN  3.0  3.0  1.0  NaN  NaN  NaN  NaN  NaN  0.0  NaN  NaN  NaN  NaN NaN  1.0  NaN  NaN  NaN  NaN NaN  NaN  1.0 NaN  NaN  2.0  NaN  1.0  NaN  NaN  NaN  NaN  1.0  NaN  NaN  0.0  NaN  NaN  1.0  NaN  1.0  1.0
MAIN_011  NaN  NaN  NaN  1.0  1.0  2.0  NaN  NaN  NaN  NaN  NaN NaN  2.0  NaN  NaN  2.0  2.0  NaN  NaN  3.0  NaN  2.0  NaN  NaN  NaN  3.0  NaN  NaN  NaN  NaN  2.0  3.0  2.0  NaN  NaN  NaN  NaN  2.0  2.0  NaN  NaN  NaN  NaN  2.0  NaN NaN NaN  2.0  NaN  NaN  NaN  NaN  NaN  2.0  NaN  3.0  3.0  2.0  NaN  NaN  NaN  NaN  NaN  3.0  NaN  3.0  NaN  2.0 NaN  NaN  NaN  NaN  3.0  NaN NaN  NaN  3.0 NaN  NaN  3.0  NaN  2.0  NaN  NaN  NaN  NaN  NaN  3.0  NaN  2.0  NaN  NaN  NaN  NaN  3.0  NaN
MAIN_012  NaN  0.0  0.0  NaN  NaN  NaN  NaN  NaN  0.0  0.0  NaN NaN  NaN  NaN  NaN  NaN  0.0  NaN  NaN  0.0  NaN  NaN  NaN  0.0  1.0  0.0  0.0  0.0  NaN  NaN  NaN  NaN  NaN  0.0  0.0  NaN  NaN  NaN  NaN  1.0  NaN  0.0  NaN  NaN  NaN NaN NaN  NaN  NaN  NaN  NaN  0.0  0.0  NaN  NaN  NaN  0.0  0.0  NaN  NaN  NaN  0.0  NaN  0.0  NaN  NaN  0.0  NaN NaN  NaN  NaN  0.0  NaN  NaN NaN  NaN -1.0 NaN  NaN  0.0  NaN  NaN  0.0  NaN  NaN  0.0  0.0  NaN  NaN -1.0  NaN  0.0  NaN  NaN  NaN  NaN
MAIN_013  2.0  NaN  NaN  3.0  NaN  2.0  NaN  NaN  NaN  NaN  NaN NaN  NaN  2.0  NaN  2.0  3.0  NaN  2.0  3.0  3.0  NaN  NaN  NaN  3.0  NaN  NaN  3.0  NaN  NaN  NaN  2.0  NaN  NaN  3.0  NaN  NaN  NaN  NaN  NaN  0.0  NaN  NaN  NaN  NaN NaN NaN  NaN  2.0  NaN  2.0  3.0  NaN  3.0  NaN  3.0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  3.0  3.0  NaN  3.0 NaN  3.0  NaN  NaN  NaN  NaN NaN  NaN  3.0 NaN  NaN  3.0  NaN  NaN  3.0  NaN  NaN  2.0  NaN  NaN  NaN  3.0  NaN  NaN  2.0  NaN  NaN  NaN
MAIN_014 -2.0  NaN  1.0  2.0  NaN  NaN  NaN  NaN  NaN  NaN  2.0 NaN  1.0  NaN  NaN  NaN  NaN  0.0  NaN  NaN  NaN  1.0  NaN  NaN  NaN  1.0  NaN  NaN  NaN  NaN -1.0  NaN  1.0  NaN  NaN  NaN -2.0  1.0  NaN -2.0 -2.0  NaN  NaN  NaN  NaN NaN NaN  1.0  2.0  NaN  0.0  0.0 -3.0  NaN  NaN  NaN  NaN  NaN  0.0  NaN  NaN  NaN  NaN  0.0  NaN  NaN  1.0  1.0 NaN -1.0  NaN  NaN  NaN  NaN NaN -1.0  NaN NaN  NaN  NaN  NaN  1.0  NaN  NaN  NaN  NaN  NaN -2.0  NaN  NaN -3.0  NaN  NaN -1.0  0.0  0.0
MAIN_015  2.0  NaN -1.0  0.0  NaN  NaN  NaN  NaN  NaN  NaN -1.0 NaN  0.0  NaN  NaN  NaN  NaN  NaN  0.0 -2.0  NaN  NaN  0.0  NaN  NaN  NaN  NaN -2.0 -1.0  NaN  0.0  1.0  NaN -1.0  NaN  NaN  NaN  NaN  NaN  NaN  0.0  NaN  NaN  1.0  NaN NaN NaN -1.0  NaN  NaN -1.0  1.0  0.0  NaN  0.0  2.0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN NaN  NaN  0.0  0.0  NaN  NaN NaN  NaN  NaN NaN  NaN -1.0  NaN  NaN  0.0  NaN  NaN  2.0  0.0  NaN  NaN  NaN -1.0  0.0  NaN -2.0  NaN  0.0
MAIN_016  NaN -1.0  NaN  NaN  NaN -2.0  NaN  1.0  NaN  NaN  NaN NaN -1.0  NaN -2.0  NaN  NaN -1.0  NaN -3.0  0.0  NaN  NaN -1.0  0.0  NaN  NaN -1.0  NaN -1.0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN -2.0  NaN -2.0  NaN  NaN NaN NaN  NaN  1.0  NaN  NaN  0.0  NaN  NaN  NaN  NaN -2.0 -2.0  NaN  NaN  0.0  1.0  NaN  NaN -3.0  NaN -2.0  NaN NaN  0.0  NaN  NaN  NaN -2.0 NaN -1.0  NaN NaN  NaN  NaN  NaN  NaN  NaN -2.0  0.0  NaN  NaN -3.0  NaN -1.0  NaN  NaN  NaN -3.0  NaN  NaN
...       ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ..  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ..  ..  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ..  ...  ...  ...  ...  ...  ..  ...  ...  ..  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...
MAIN_285  NaN  NaN  NaN  NaN -2.0 -1.0  NaN -2.0  NaN  NaN  2.0 NaN -1.0  NaN  NaN  NaN  NaN  NaN -2.0  NaN  NaN  NaN  NaN  NaN -2.0 -2.0 -1.0 -1.0  NaN  NaN  NaN  NaN  NaN -2.0 -3.0  NaN  NaN  NaN  NaN  NaN  NaN  NaN -2.0  NaN -2.0 NaN NaN  NaN  2.0 -1.0 -2.0  NaN  NaN  NaN -1.0  NaN  NaN  NaN  NaN  NaN -2.0 -1.0  NaN  NaN -3.0  NaN  1.0 -2.0 NaN  NaN  NaN  1.0  NaN  NaN NaN  NaN -2.0 NaN  NaN -2.0  NaN  NaN -3.0  NaN  NaN -2.0  NaN -3.0  NaN  NaN -3.0  NaN  NaN  NaN  NaN -1.0
MAIN_286  NaN  NaN  2.0  NaN  1.0  NaN  NaN  1.0  NaN  0.0  2.0 NaN  NaN  NaN  NaN  NaN  NaN  NaN  0.0  2.0  NaN  NaN  NaN  NaN  NaN  2.0  1.0  NaN  0.0  NaN  NaN  NaN  NaN  1.0  2.0  1.0  NaN  NaN  NaN  2.0  NaN  NaN  NaN  2.0  NaN NaN NaN  NaN  NaN  NaN  2.0  NaN  0.0  NaN  NaN  NaN  NaN  NaN  0.0  3.0  NaN  NaN  NaN  NaN  NaN  2.0  2.0  NaN NaN  NaN  1.0  NaN -1.0  1.0 NaN  NaN  NaN NaN  1.0  NaN  NaN  1.0  NaN  2.0  NaN  NaN  NaN  NaN  1.0  NaN  NaN  NaN  0.0  1.0  NaN  NaN
MAIN_287  2.0  NaN  2.0  NaN  NaN  NaN  NaN  NaN  2.0  0.0  0.0 NaN  NaN  NaN  NaN  NaN  NaN  2.0  NaN  NaN  NaN  NaN  1.0  0.0  1.0  NaN  NaN  NaN  NaN  1.0  NaN  1.0  NaN  NaN  NaN  NaN  NaN  0.0  2.0  NaN  NaN  NaN  NaN  1.0  0.0 NaN NaN  NaN  NaN  0.0  NaN  NaN  0.0  NaN  NaN  0.0  NaN  NaN  NaN  NaN  1.0  NaN  NaN  1.0  NaN  0.0  NaN  NaN NaN  2.0  NaN  NaN  NaN  1.0 NaN  NaN  NaN NaN  0.0  NaN  0.0  NaN  NaN  2.0  2.0  NaN  NaN  NaN  NaN  0.0  NaN  0.0  NaN  NaN  NaN  2.0
MAIN_288  NaN -2.0  NaN  NaN  NaN -2.0  NaN  NaN -3.0  NaN -2.0 NaN  NaN -2.0  NaN  NaN  NaN  NaN -3.0  NaN -3.0  NaN  NaN  NaN -3.0  NaN  NaN -1.0  NaN -2.0  NaN  NaN  NaN -1.0  NaN  NaN -3.0  NaN  NaN -3.0 -2.0  NaN  NaN -2.0  NaN NaN NaN -3.0  NaN  NaN  NaN  NaN  NaN -3.0 -3.0  NaN  NaN  NaN  NaN  NaN  NaN -2.0 -3.0 -2.0  NaN  NaN  NaN -2.0 NaN  NaN  NaN  NaN  0.0  NaN NaN -2.0  NaN NaN  NaN  NaN  NaN  NaN -3.0  NaN  NaN  0.0  NaN  NaN  NaN -2.0  NaN -1.0  NaN -3.0  NaN  NaN
MAIN_289  NaN  NaN  NaN -1.0 -1.0 -1.0  NaN  NaN  NaN  NaN  NaN NaN  NaN -2.0 -2.0  NaN  NaN  NaN -1.0  NaN -1.0  NaN  NaN  NaN -1.0  NaN  NaN  NaN  NaN -2.0  NaN -3.0  NaN -1.0  NaN -3.0  NaN  NaN  NaN  NaN -2.0  NaN  NaN -3.0 -3.0 NaN NaN  NaN  NaN -3.0 -2.0  NaN  NaN  NaN -1.0 -3.0  NaN  NaN  NaN -2.0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN NaN -3.0 -2.0  NaN  NaN -3.0 NaN  NaN  NaN NaN -1.0  NaN -2.0  NaN  NaN  NaN -2.0  NaN  NaN  NaN -3.0  NaN  NaN  NaN -2.0  NaN -3.0 -1.0
MAIN_290  NaN  NaN  NaN  NaN  2.0  2.0  NaN  2.0  NaN  NaN  3.0 NaN  2.0  NaN  NaN  2.0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  1.0  NaN  2.0  NaN  NaN  NaN  NaN  2.0  NaN  NaN  NaN  3.0  3.0  3.0  NaN  NaN  NaN  2.0  3.0  3.0  NaN  NaN NaN NaN  NaN  NaN  NaN  NaN  2.0  NaN  3.0  NaN  NaN  3.0  2.0  NaN  NaN  NaN  NaN  2.0  NaN  NaN  3.0  NaN  3.0 NaN  3.0  1.0  NaN  NaN  NaN NaN  NaN  NaN NaN  2.0  NaN  NaN  3.0  NaN  2.0  NaN  NaN  NaN  NaN  3.0  NaN  NaN  1.0  NaN  3.0  NaN  2.0
MAIN_291 -2.0  NaN  NaN  NaN  NaN -1.0  NaN  NaN -2.0 -3.0  NaN NaN  NaN  NaN  NaN -2.0 -3.0  NaN  NaN -3.0  NaN -2.0  NaN  NaN  NaN  0.0 -2.0 -1.0  NaN  NaN -1.0  NaN -2.0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN -3.0 -2.0  NaN  NaN NaN NaN  NaN  NaN  NaN -1.0 -2.0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN -2.0  NaN  NaN  NaN -3.0 -3.0 -2.0  NaN NaN  NaN  NaN  0.0  NaN  NaN NaN  NaN  NaN NaN -1.0  NaN  NaN -2.0  NaN -2.0  NaN  NaN -1.0 -2.0 -2.0  NaN  NaN  NaN  NaN -3.0  NaN  0.0
MAIN_292  2.0  NaN  NaN  1.0  NaN  0.0  NaN  NaN  NaN  NaN  NaN NaN  NaN  0.0 -2.0  1.0  NaN  NaN  NaN  0.0  NaN  NaN  0.0  1.0  NaN  NaN  0.0  0.0  NaN  0.0  NaN  NaN  0.0  NaN  NaN  NaN  NaN  NaN  NaN  0.0  NaN  NaN  NaN  NaN  NaN NaN NaN  NaN  1.0  1.0  NaN  NaN  NaN  1.0  NaN -1.0  0.0  0.0  NaN  NaN  NaN  1.0  NaN  0.0  NaN  NaN  NaN  NaN NaN  NaN  NaN  NaN  1.0  1.0 NaN  NaN  NaN NaN  1.0  NaN  0.0  1.0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  0.0  NaN  NaN  1.0  NaN  1.0  NaN
MAIN_293  2.0  NaN  NaN  0.0  NaN  NaN  1.0  NaN  NaN  NaN  NaN NaN  NaN -1.0  0.0  0.0  NaN  NaN  NaN  NaN  NaN  0.0  0.0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  0.0  NaN  1.0  NaN  NaN  NaN  0.0  0.0  NaN  0.0  0.0  0.0  NaN  NaN  NaN NaN NaN  0.0  NaN  NaN -1.0  NaN  NaN  1.0  NaN -1.0  NaN  NaN  0.0  NaN  NaN  1.0  NaN  NaN  NaN  NaN  NaN  NaN NaN  NaN  0.0  NaN  2.0  NaN NaN  NaN  NaN NaN  NaN  1.0  1.0  NaN  0.0  NaN  NaN  1.0  0.0 -1.0  NaN  NaN -2.0  NaN  NaN  NaN  NaN  0.0
MAIN_294  NaN  2.0  2.0  NaN  NaN  NaN  NaN  NaN  3.0  0.0  NaN NaN  NaN  NaN  3.0  1.0  NaN  NaN  1.0  3.0  NaN  NaN  NaN  NaN  NaN  1.0  NaN  NaN  3.0  NaN  NaN  NaN  3.0  NaN  NaN  3.0  NaN  NaN  NaN  3.0  0.0  NaN  NaN  1.0  NaN NaN NaN  NaN  NaN  NaN  NaN -1.0  NaN  NaN  NaN  NaN  NaN  2.0  2.0  NaN  2.0  0.0  2.0  NaN  3.0  NaN  NaN  1.0 NaN  NaN  NaN  3.0  NaN  NaN NaN  2.0  3.0 NaN  NaN  NaN  NaN  NaN  2.0  NaN  NaN  1.0  NaN  NaN  2.0  NaN  NaN  NaN  3.0  NaN  NaN  NaN
MAIN_295  NaN  2.0  2.0  NaN  NaN  NaN  NaN  NaN  3.0  2.0  NaN NaN  NaN  NaN  1.0  1.0  NaN  NaN  NaN  NaN  2.0  NaN  NaN  2.0  2.0  NaN  NaN  NaN  NaN  2.0  NaN  NaN  NaN  NaN  NaN  1.0  NaN  NaN  NaN  NaN  2.0  NaN  2.0  3.0  1.0 NaN NaN  NaN  NaN  2.0  NaN  NaN  NaN  NaN  NaN  NaN  3.0  1.0  NaN  NaN  3.0  NaN  NaN  2.0  NaN  3.0  3.0  NaN NaN  NaN  NaN  3.0  NaN  3.0 NaN  NaN  2.0 NaN  1.0  NaN  NaN  2.0  NaN  NaN  NaN  NaN  NaN  3.0  NaN  1.0  NaN  NaN  NaN  NaN  2.0  NaN
MAIN_296  2.0  NaN  NaN  NaN  NaN  NaN  2.0  NaN  1.0  NaN  NaN NaN  0.0  NaN  0.0  NaN  NaN  NaN  NaN  0.0  1.0  2.0  NaN  NaN  0.0  NaN  0.0  NaN  NaN  NaN  0.0  NaN  NaN  0.0  NaN  1.0  NaN  NaN  NaN  2.0  NaN  1.0  NaN  NaN  NaN NaN NaN  2.0  NaN  NaN  NaN  1.0  NaN  0.0  NaN  NaN  NaN  1.0  0.0  NaN  NaN  NaN  1.0  2.0  NaN  NaN  NaN  NaN NaN  NaN  NaN  NaN  1.0  NaN NaN  NaN  NaN NaN  1.0  NaN  NaN  1.0  NaN  2.0  NaN  NaN  1.0  3.0  3.0  NaN  NaN  NaN  NaN  3.0  NaN  NaN
MAIN_297  NaN -1.0 -2.0 -1.0  NaN  NaN  NaN  NaN  NaN  NaN  NaN NaN  NaN -2.0  NaN  NaN -3.0  NaN -1.0 -2.0 -1.0  NaN  NaN  NaN  NaN  NaN  NaN  NaN -1.0  NaN  NaN -3.0 -3.0 -2.0  NaN  NaN  NaN -2.0  NaN  NaN -2.0  NaN  NaN -2.0  NaN NaN NaN  NaN  NaN  NaN -2.0 -2.0  NaN  NaN -1.0 -3.0  NaN  NaN  NaN -2.0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN NaN  NaN -1.0  NaN -3.0 -3.0 NaN -1.0  NaN NaN  NaN  NaN -3.0  NaN  NaN  NaN -2.0  NaN  NaN -3.0  NaN  NaN -3.0  NaN  NaN  NaN -2.0  NaN
MAIN_298 -2.0  NaN  NaN  NaN  NaN -1.0  NaN  NaN -3.0  NaN  NaN NaN  NaN -1.0  NaN  NaN -3.0  NaN  NaN  NaN  NaN  NaN -2.0 -2.0  NaN  NaN -2.0  NaN  NaN -2.0  NaN  NaN -2.0 -3.0  NaN  NaN  NaN -3.0  NaN  NaN  NaN  NaN -3.0 -2.0 -2.0 NaN NaN  NaN  NaN -2.0  NaN  NaN  NaN -3.0  NaN  NaN  NaN -2.0 -2.0  NaN  NaN -2.0 -3.0 -3.0  NaN  NaN  NaN -3.0 NaN  NaN  NaN  NaN -2.0  NaN NaN -3.0 -3.0 NaN  NaN  NaN  NaN -3.0  NaN -1.0  NaN  NaN  NaN  NaN  NaN  NaN -3.0 -2.0  NaN  NaN  NaN  NaN
MAIN_299  NaN  NaN  NaN -2.0 -2.0 -3.0  NaN  NaN  NaN -3.0  NaN NaN  NaN  NaN -1.0  NaN  NaN  NaN  NaN  NaN -2.0  NaN  NaN -2.0  NaN  NaN  NaN  NaN  NaN  NaN -1.0 -2.0  NaN  0.0 -3.0  NaN -2.0 -2.0  NaN  NaN -2.0  NaN  NaN  NaN  NaN NaN NaN  NaN -2.0 -3.0 -2.0  NaN -3.0  NaN  NaN  NaN  NaN  NaN -2.0  NaN  NaN -2.0  NaN -2.0  NaN  NaN -3.0  NaN NaN  NaN  NaN -2.0  NaN -3.0 NaN  NaN  NaN NaN -2.0  NaN  NaN  NaN -2.0  NaN  NaN -2.0  NaN  NaN  NaN  NaN -3.0 -1.0  NaN -3.0  NaN  NaN
MAIN_300  NaN  NaN -2.0  NaN -2.0  NaN  NaN  NaN -2.0  NaN  NaN NaN  NaN -2.0 -2.0  NaN  NaN -3.0  NaN -3.0 -3.0  NaN  NaN -2.0 -2.0  NaN  NaN  NaN  NaN  NaN  NaN -3.0  NaN  NaN -3.0  NaN  NaN -3.0  NaN  NaN -2.0 -3.0  NaN  NaN  NaN NaN NaN  NaN  NaN  NaN  NaN -2.0  NaN  NaN  NaN -3.0 -3.0 -3.0  NaN  NaN -1.0 -3.0  NaN  NaN -3.0  NaN  NaN  NaN NaN  NaN  NaN  NaN  3.0 -3.0 NaN -2.0  1.0 NaN  NaN  NaN  NaN -3.0  NaN -3.0  NaN  NaN  NaN  NaN -3.0  NaN  NaN  NaN -2.0  NaN  NaN  NaN

[300 rows x 96 columns]
#+end_example
:END:
